In [1]:
import pandas as pd   #python Library

In [34]:
coloums=["user_id","item_id","rating","timestamp"]  #naming coloumns for easy access
df=pd.read_csv("/home/siddhant/ratings.tsv",sep='\t',names=coloums)#reading tsv files for ratings related data
df.head() #printing some top entries of file

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [5]:
movie_names=pd.read_csv("/home/siddhant/movies.csv")#reading csv file for movie title
movie_names.head() #printing some top entries from file

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [7]:
data=pd.merge(df,movie_names,on="item_id")  #merging two files in context of item_id's
data.head() #again printing some top entries of file after merging

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [9]:
rating_mean=data.groupby('title')['rating'].mean()  #calculating mean of rating for each movie

In [13]:
rating_mean.sort_values(ascending=False).head() # sorting ratings

title
Marlene Dietrich: Shadow and Light (1996)     5.0
Prefontaine (1997)                            5.0
Santa with Muscles (1996)                     5.0
Star Kid (1997)                               5.0
Someone Else's America (1995)                 5.0
Name: rating, dtype: float64

In [14]:
count_ratings=data.groupby('title')['rating'].count() # counting total ratings of each movie

In [15]:
count_ratings.sort_values(ascending=False).head() #sorting and printing total ratings of each movie

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64

In [30]:
#recommendation=pd.merge(count_ratings,rating_mean,on='title')
recommendation=pd.DataFrame(rating_mean)  #making dataframe  
recommendation['num of ratings']=pd.DataFrame(count_ratings)

In [32]:
recommendation.sort_values(ascending=False,by='rating').head() #printing final result

                                            rating  num of ratings
title
They Made Me a Criminal (1939)                 5.0               1
Marlene Dietrich: Shadow and Light (1996)      5.0               1
Saint of Fort Washington, The (1993)           5.0               2
Someone Else's America (1995)                  5.0               1
Star Kid (1997)                                5.0               3

In [33]:
#recommendation.head()

                             rating  num of ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41